<template lang="pug">
.oats-promo
  er-promo(
    banner="oats-promo.png"
    :featureList="featureList"
    linkToConnect="https://b2b.dom.ru"
  )
</template>

<script>
import ErPromo from '@/components/blocks/ErPromo/index.vue'

const featureList = [
  {
    icon: 'time',
    name: 'Расписание звонков',
    description:
      'Вы сами задаете расписание для обработки и распределения звонков в зависимости от дня недели, времени суток, отпусков менеджеров или выезда их на личные встречи. Например, в рабочее время звонок приходит в отдел продаж, вечером — дежурному менеджеру, ночью переадресуется на голосовую почту (АТС при этом сообщит клиенту, что ему перезвонят утром).'
  },
  {
    icon: 'call_settings',
    name: 'Управление звонками',
    description:
      'Облачная АТС настраиватся в режиме реального времени под ваши задачи. Важно сократить время ожидания клиента на линии — настройте дозвон сразу до всех сотрудников, принимающих вызовы. Задача увеличить качество продаж — измените параметры и АТС адресует звонок самым опытным менеджерам.'
  },
  {
    icon: 'stat',
    name: 'История и статистика разговоров',
    description:
      'Вы контролируете, кто, куда, когда звонил, сколько было принято звонков, а сколько пропущено, сколько по времени длился звонок и как менеджер общался с клиентами. Запись разговоров повышает эффективность менеджеров и может быть использована в качестве наглядного примера для обучения новичков.'
  },
  {
    icon: 'list_numbers',
    name: 'Многоканальный номер',
    description:
      'Многоканальный номер позволяет принимать несколько звонков одновременно, поэтому ваш клиент никогда не услышит «занято», позвонив Вам.'
  },
  {
    icon: 'integration',
    name: 'Интеграция с CRM',
    description:
      'Для ведения и эффективного управления базой клиентов в виртуальной облачной АТС «Дом.ru Бизнес» предусмотрена интеграция с популярными CRM-системами — AmoCRM, Битрикс, Retail CRM и др.'
  },
  {
    icon: 'cancel',
    name: 'Черный список',
    description:
      'Чтобы не тратить время на пустые разговоры и нежелательные звонки, а сфокусироваться только на важных, вы можете настроить свой «черный список номеров».'
  }
]

export default {
  name: 'OATSPromo',
  components: {
    ErPromo
  },
  data () {
    return {
      featureList
    }
  }
}
</script>

<style scoped>

</style>
