import PointComponent from './blocks/PointComponent'

export default {
  name: 'ddos-page',
  components: {
    PointComponent
  },

  data () {
    return {
      pre: 'ddos-page',
      isOpen: false,
      data: [
        {
          name: 'г. Санкт-Петербург, ул. Большая Константинопольская, д. 100',
          abon: 3800000,
          date: '17.08.1918',
          stopped: false
        },
        {
          name: 'г. Санкт-Петербург, ул. Большая Константинопольская, д. 100, к. 324',
          abon: 333800,
          date: '17.08.2018',
          stopped: false
        },
        {
          name: 'С. Кукуево, пр-кт. Трактористов, д. 2, корпус 1',
          abon: 30,
          date: '17.08.2030',
          stopped: false
        },
        {
          name: 'С. Кукуево, пр-кт. Трактористов, д. 2, корпус 1',
          abon: 3878900,
          date: '17.08.2018',
          stopped: true
        },
        {
          name: 'С. Кукуево, пр-кт. Трактористов, д. 2, корпус 1',
          abon: 38045646460,
          date: '40.50.6070',
          stopped: false
        },
        {
          name: 'С. Кукуево, пр-кт. Трактористов, д. 2, корпус 1С. Кукуево, пр-кт. Трактористов, д. 2, корпус 1С. Кукуево, пр-кт. Трактористов, д. 2, корпус 1',
          abon: 38045646460,
          date: '40.50.6070',
          stopped: false
        },
        {
          name: 'С. Кукуево, пр-кт. Трактористов, д. 2, корпус 1С. Кукуево, пр-кт. Трактористов, д. 2, корпус 1',
          abon: 38045646460,
          date: '40.50.6070',
          stopped: false
        },
        {
          name: 'С. Кукуево, пр-кт. Трактористов, д. 2, корпус 1',
          abon: 3,
          date: '17.08.2018',
          stopped: true
        }
      ]
    }
  }
}
